Updated profiling documentation
